const ilg = [
  '異能者',
  '守護者使い',
  '魔剣',
  '忍',
  'グラップラー',
  'キラーエリート',
  'ダメ半魔',
  'アクションヒーロー',
]

const vmp = ['血族', 'ダンピール', 'ドラクル', 'ニュービー', 'レンフィールド']
const etr = [
  '寄生体',
  '執行者',
  '増殖体',
  '宇宙人',
  'スライム',
  'クライシス星人',
  '宇宙海賊',
  '綺士',
]
const spl = ['幽霊', '夢蝕み', '妖精', '召喚獣', '妖獣', '雪の精']
const sls = [
  '神格',
  '天使',
  '竜',
  '化狐',
  '森の乙女',
  '黄道十二宮の天使',
  'チャンピオン',
  'ヴァルキリー',
]
const dmn = [
  '地獄の道化師',
  '魔王の後継者',
  '魔神',
  '死せる者',
  'オーク',
  '契約者',
  'アマルガム',
]
const nei = [
  '鬼',
  '人狼',
  'バステトの子ら',
  '半漁人',
  '熊人',
  '魔蜂族',
  'グレートゴリラ',
  'ケンタウロス',
  '天狗',
  'ワースネーク',
  'デスシャーク',
  '巨人',
]
const her = [
  'ブラックコート',
  'マジシャン',
  'ロード',
  '機動警察',
  '退魔僧',
  '風水師',
  '比良坂流行者',
  'メディア',
  '魔狩人',
  '凄皇流',
  '巫女',
  'モータル',
]
const fmt = [
  'サイボーグ',
  '自動人形',
  '造られた怪物',
  'ギアライダー',
  'トイロボ',
  '着装者',
  'メタモーファー',
  '継承者',
]

const leg = [
  '御伽噺の住人',
  '伝説の英雄',
  '都市伝説',
  '転生者',
  'アイドル',
  '妖怪',
]
const voi = ['死神', '虚銃使い']
const str = [
  '転校生',
  '電脳魔術師',
  '魔女',
  'マッドサイエンティスト',
  'R.E.L.I.C',
  'タイムトラベラー',
  '名探偵',
  'ヴィラン',
  '呪われし者',
  '帰還者',
  '始原人',
]
const cos = ['落とし子', '眷属', '邪神の分霊', '彷徨える少女']
const dar = ['怪人', '幹部', '戦闘員', '偽ヒーロー', 'アウトサイダー']
const gig = ['怪獣使い']

export const blood = [
  'イレギュラー',
  'ヴァンパイア',
  'エトランゼ',
  'スピリット',
  'セレスチャル',
  'デーモン',
  'ネイバー',
  'ハーミット',
  'フルメタル',
  'レジェンド',
  'ヴォイド',
  'ストレンジャー',
  'コズミックホラー',
  'ダークカルテル',
  'ジャイガント',
]

export const bloodAndRoots = [
  { name: 'イレギュラー', roots: [...ilg] },
  { name: 'ヴァンパイア', roots: [...vmp] },
  { name: 'エトランゼ', roots: [...etr] },
  { name: 'スピリット', roots: [...spl] },
  { name: 'セレスチャル', roots: [...sls] },
  { name: 'デーモン', roots: [...dmn] },
  { name: 'ネイバー', roots: [...nei] },
  { name: 'ハーミット', roots: [...her] },
  { name: 'フルメタル', roots: [...fmt] },
  { name: 'レジェンド', roots: [...leg] },
  { name: 'ヴォイド', roots: [...voi] },
  { name: 'ストレンジャー', roots: [...str] },
  { name: 'コズミックホラー', roots: [...cos] },
  { name: 'ダークカルテル', roots: [...dar] },
  { name: 'ジャイガント', roots: [...gig] },
]

export const styles = ['アタッカー', 'ディフェンダー', 'サポーター']
